_site_old/assets/blog20140526_wso2_mtom_2/proxies-mtom.xml


<!-- === -->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.samples">   
  <soapenv:Header/>   
  <soapenv:Body>      
     <ser:uploadFileUsingMTOM>         
        <ser:request>           
           <ser:image>cid:tux-grenade.png</ser:image>         
        </ser:request>      
     </ser:uploadFileUsingMTOM>   
  </soapenv:Body>
</soapenv:Envelope>

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <mediate>
         <INITIAL_FILE>
            <xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:3e5141cea573a259db15aefffb5f1b3e8c1f1fc3c6eb6963@apache.org"></xop:Include>
         </INITIAL_FILE>
      </mediate>
   </soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope 
       xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
       xmlns:ser="http://services.samples">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:oneWayUploadUsingHTTP>
        <myimagefile><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:3e5141cea573a259db15aefffb5f1b3e8c1f1fc3c6eb6963@apache.org"></xop:Include></myimagefile>
      </ser:oneWayUploadUsingHTTP>
   </soapenv:Body>
</soapenv:Envelope>

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <mediate>
      <myimagefile>...content in base64...</myimagefile>
    </mediate>
  </soapenv:Body>
</soapenv:Envelope>


<!-- *******************************-***************************** -->

<?xml version="1.0" encoding="UTF-8"?>
<proxy xmlns="http://ws.apache.org/ns/synapse"
       name="MTOMSwASampleService_http"
       transports="https,http"
       statistics="disable"
       trace="disable"
       startOnLoad="true">
   <target>
      <inSequence>
         <log level="custom">
            <property name="****** MTOMSwASampleService - HTTP" value="***** inSeq - ini"/>
         </log>
         <property name="DISABLE_CHUNKING" value="true"/>
         <property name="Action" value="urn:oneWayUploadUsingHTTP" scope="default"/>
         <header name="Action" scope="default" value="urn:oneWayUploadUsingHTTP"/>
         <send>
            <endpoint>
               <address uri="http://localhost:8281/services/MTOMSwASampleService_proxy"
                        format="soap11"/>
            </endpoint>
         </send>
         <log level="custom">
            <property name="****** MTOMSwASampleService - HTTP" value="***** inSeq - fin"/>
         </log>
      </inSequence>
      <outSequence>
         <log level="custom">
            <property name="******* MTOMSwASampleService - HTTP" value="***** outSeq - ini"/>
         </log>
         <property name="OUT_ONLY" value="true"/>
         <property name="FORCE_SC_ACCEPTED" value="true"/>
         <send/>
         <log level="custom">
            <property name="******* MTOMSwASampleService - HTTP" value="***** outSeq - fin"/>
         </log>
      </outSequence>
   </target>
   <description>Proxy Upload File using Multipart Form Data</description>
</proxy>
                                
                                                 
<!-- =====---- proxy2 ----- ===== -->

<?xml version="1.0" encoding="UTF-8"?>
<proxy xmlns="http://ws.apache.org/ns/synapse"
       name="MTOMSwASampleService_proxy"
       transports="https,http"
       statistics="disable"
       trace="disable"
       startOnLoad="true">
   <target>
      <inSequence>
         <log level="custom">
            <property name="======== Proxy-MTOMSwASampleService" value="====== inSeq - ini"/>
         </log>
         <filter source="get-property('Action')" regex="urn:oneWayUploadUsingHTTP">
            <then>
               <log level="custom">
                  <property name="...calling " value="oneWayUploadUsingHTTP"/>
               </log>
               <property name="OUT_ONLY" value="true"/>
               <property name="FORCE_SC_ACCEPTED" value="true" scope="axis2"/>
               <property name="example" value="onewayhttp"/>
               <send>
                  <endpoint>
                     <address uri="http://localhost:9000/services/MTOMSwASampleService"/>
                  </endpoint>
               </send>
            </then>
            <else/>
         </filter>
         <filter source="get-property('Action')" regex="urn:uploadFileUsingMTOM">
            <then>
               <log level="custom">
                  <property name="...calling " value="uploadFileUsingMTOM"/>
               </log>
               <header name="Action" scope="default" action="remove"/>
               <property name="SOAPAction" scope="default" action="remove"/>
               <property name="example" value="mtom"/>
               <property name="Action" value="urn:uploadFileUsingMTOM" scope="default"/>
               <header name="Action" scope="default" value="urn:uploadFileUsingMTOM"/>
               <send>
                  <endpoint>
                     <address uri="http://localhost:9000/services/MTOMSwASampleService"
                              optimize="mtom"/>
                  </endpoint>
               </send>
            </then>
            <else/>
         </filter>
         <filter source="get-property('Action')" regex="urn:uploadFileUsingSwA">
            <then>
               <log level="custom">
                  <property name="...calling " value="uploadFileUsingSwA"/>
               </log>
               <property name="example" value="swa"/>
               <send>
                  <endpoint>
                     <address uri="http://localhost:9000/services/MTOMSwASampleService"
                              optimize="swa"/>
                  </endpoint>
               </send>
            </then>
            <else/>
         </filter>
         <filter source="get-property('Action')" regex="urn:oneWayUploadUsingMTOM">
            <then>
               <log level="custom">
                  <property name="...calling " value="oneWayUploadUsingMTOM"/>
               </log>
               <property name="OUT_ONLY" value="true"/>
               <property name="FORCE_SC_ACCEPTED" value="true" scope="axis2"/>
               <property name="example" value="onewaymtom"/>
               <send>
                  <endpoint>
                     <address uri="http://localhost:9000/services/MTOMSwASampleService"
                              optimize="mtom"/>
                  </endpoint>
               </send>
            </then>
            <else/>
         </filter>
         <log level="custom">
            <property name="======== Proxy MTOMSwASampleService" value="====== inSeq - fin"/>
         </log>
      </inSequence>
      <outSequence>
         <log level="custom">
            <property name="======== Proxy MTOMSwASampleService" value="====== outSeq - ini"/>
         </log>
         <filter source="get-property('example')" regex="onewayhttp">
            <property name="enableMTOM" value="true" scope="axis2"/>
         </filter>
         <filter source="get-property('example')" regex="onewaymtom">
            <property name="enableMTOM" value="true" scope="axis2"/>
         </filter>
         <filter source="get-property('example')" regex="mtom">
            <property name="enableMTOM" value="true" scope="axis2"/>
         </filter>
         <filter source="get-property('example')" regex="swa">
            <property name="enableSwA" value="true" scope="axis2"/>
         </filter>
         <send/>
         <log level="custom">
            <property name="======== Proxy MTOMSwASampleService" value="====== outSeq - fin"/>
         </log>
      </outSequence>
   </target>
   <publishWSDL uri="http://localhost:9000/services/MTOMSwASampleService?wsdl"/>
   <parameter name="enableMTOM">true</parameter>
   <description>MTOMSwASampleService (Sample 51) updated</description>
</proxy>
                                